insert into catalog.department
values (1, 'г. Череповец, ул. Первомайская, 25/2', '8 (8202) 53-47-97'),
       (2, 'г. Череповец, ул. Комарова, 12А', '8 (8202) 57-15-29)'),
       (3, 'г. Череповец, пр-кт Шекснинский, 127', '8 (8202) 31-49-11'),
       (4, 'г. Череповец, пер. Серов, 3', '8 (8202) 27-12-89');

insert into catalog.car
values (1, 'АС118Р', 'ГАЗель Next "Белава 2380"', 3, 1),
       (2, 'АН536Н', 'ГАЗель Next "Белава 2380"', 3, 2),
       (3, 'АУ935М', 'ГАЗель Next "Белава 2380"', 3, 3),
       (4, 'АЕ461С', 'ГАЗель NEXT "ГАЗ A31R22"', 3, 4),
       (5, 'АХ719В', 'ГАЗель NEXT "ГАЗ A31R22"', 3, 1),
       (6, 'AХ523Ш', 'Fiat Ducato, класс А', 3, 2),
       (7, 'АИ159П', 'Fiat Ducato, класс А', 3, 3),
       (8, 'АИ772К', 'Fiat Ducato, класс А', 3, 4),
       (9, 'АУ208Н', 'Mercedes Sprinter, класс А', 3, 1);

insert into catalog.cause
values (1, 'CB001', 'Рвота', 2),
       (2, 'CB002', 'Головная боль', 4),
       (3, 'CB003', 'Температура', 3),
       (4, 'CB004', 'Стул с кровью', 0),
       (5, 'CB005', 'Перелом конечности', 4),
       (6, 'CB006', 'Инсульт', 0),
       (7, 'CB007', 'Потеря сознания', 1),
       (8, 'CB008', 'Галлюцинации', 3),
       (9, 'CB009', 'Боль в животе', 3),
       (10, 'CB010', 'Травматическая ампутация', 0);

insert into catalog.material_type
values (1, 'Перевязочный материал', false),
       (2, 'Сильнодействующее средство', true),
       (3, 'Седативное средство', false),
       (4, 'Наркотическое средство', true),
       (5, 'Обеззараживающее средство', false),
       (6, 'Противовоспалительное средство', false),
       (7, 'Противобактериальное средство', false),
       (8, 'Противорвотное средство', false),
       (9, 'Витамины', false),
       (10, 'Противоаллергическое средство', false);

insert into catalog.material
values (1, 'Бинт эластичный, 1 м', 1),
       (2, 'Пакет индивидуальный перевязочный', 1),
       (3, 'Празепам', 2),
       (4, 'Реладорм', 2),
       (5, 'Валидол', 3),
       (6, 'Промедол', 4),
       (7, 'Перекись водорода 3%', 5),
       (8, 'Фурасол', 5),
       (9, 'Аэртал', 6),
       (10, 'Ибупрофен', 6),
       (11, 'Кларитромицин', 7),
       (12, 'Амоксиклав', 7),
       (13, 'Церукал', 8),
       (14, 'Аскорбиновая кислота', 9),
       (15, 'Супрастин', 10);

insert into catalog.position
values (1, 'Фельдшер'),
       (2, 'Водитель'),
       (3, 'Диспетчер'),
       (4, 'Врач'),
       (5, 'Стажер');

insert into catalog.specialization
values (1, 'Линейная'),
       (2, 'Реанимация'),
       (3, 'Психиатрическая'),
       (4, 'Педиатрическая'),
       (5, 'Кардиологическая');

insert into catalog.status
values (1, 'Создан'),
       (2, 'В пути'),
       (3, 'Оказание помощи'),
       (4, 'Выполнен'),
       (5, 'Отменен');

insert into catalog.employee
values (1, 'Иван', 'Иванов', '10002434', '04-29-1989', 1, 1),
       (2, 'Петр', 'Петров', '10002435', '04-29-1989', 1, 1),
       (3, 'Алексей', 'Алексеев', '10002436', '04-29-1989', 1, 1),
       (4, 'Валерий', 'Валерьев', '10002437', '04-29-1989', 1, 1),
       (5, 'Александр', 'Александров', '10002438', '04-29-1989', 1, 2),
       (6, 'Сергей', 'Сергеев', '10002439', '04-29-1989', 1, 2),
       (7, 'Михаил', 'Михайлов', '10002440', '04-29-1989', 1, 2),
       (8, 'Андрей', 'Андреев', '10002441', '04-29-1989', 1, 2),
       (9, 'Артур', 'Артуров', '10002442', '04-29-1989', 1, 3),
       (10, 'Захар', 'Захаров', '10002443', '04-29-1989', 1, 3),
       (11, 'Игнат', 'Игнатьев', '10002444', '04-29-1989', 1, 3),
       (12, 'Степан', 'Степанов', '10002445', '04-29-1989', 1, 3),
       (13, 'Илья', 'Ильин', '10002446', '04-29-1989', 1, 4),
       (14, 'Владимир', 'Владимиров', '10002447', '04-29-1989', 1, 4),
       (15, 'Евгений', 'Евгеньев', '10002448', '04-29-1989', 1, 4),
       (16, 'Антон', 'Антонов', '1000249', '04-29-1989', 1, 4),
       (17, 'Егор', 'Егоров', '20001992', '04-29-1989', 2, 1),
       (18, 'Роман', 'Романов', '20001993', '04-29-1989', 2, 1),
       (19, 'Борис', 'Борисов', '20001994', '04-29-1989', 2, 2),
       (20, 'Кирилл', 'Кириллов', '20001995', '04-29-1989', 2, 2),
       (21, 'Дмитрий', 'Дмитриев', '20001996', '04-29-1989', 2, 3),
       (22, 'Николай', 'Николаев', '20001997', '04-29-1989', 2, 3),
       (23, 'Максим', 'Максимов', '20001998', '04-29-1989', 2, 4),
       (24, 'Павел', 'Павлов', '20001999', '04-29-1989', 2, 4),
       (25, 'Алла', 'Аллова', '30007243', '04-29-1989', 3, 1),
       (26, 'Татьяна', 'Татьянова', '30007244', '04-29-1989', 3, 2),
       (27, 'Галина', 'Галинова', '30007245', '04-29-1989', 3, 3),
       (28, 'Ирина', 'Иринова', '30007246', '04-29-1989', 3, 4),
       (29, 'Данил', 'Данилов', '40003725', '04-29-1989', 4, 1),
       (30, 'Никита', 'Никитин', '40003726', '04-29-1989', 4, 2),
       (31, 'Полина', 'Полинова', '40003727', '04-29-1989', 4, 3),
       (32, 'Светлана', 'Светланова', '40003728', '04-29-1989', 4, 4);


